read_verilog -sv /home/elfo/Documents/ELEC5705/Project/rtl/cal_register.sv
hierarchy -top cal_register
proc
opt
fsm
opt
memory
opt
techmap
opt
abc -g simple
opt_clean
stat
write_json /home/elfo/Documents/ELEC5705/A3/project_synthesis_experiment/block_outputs/cal_register.json
write_verilog -noattr /home/elfo/Documents/ELEC5705/A3/project_synthesis_experiment/block_outputs/cal_register_netlist.v
show -format dot -prefix /home/elfo/Documents/ELEC5705/A3/project_synthesis_experiment/block_outputs/cal_register
